In [3]:
import pandas as pd
import numpy as np

# Pandas Data Series()

In [469]:
labels = 'a b c'.split(' ')
my_list = [10, 20, 30]
arr = np.array(my_list)
d = {
    'a' : 10,
    'b' : 20,
    'c' : 30
}

In [470]:
pd.Series(data = my_list)

0    10
1    20
2    30
dtype: int64

In [471]:
pd.Series(my_list, labels)

a    10
b    20
c    30
dtype: int64

In [472]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [473]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [474]:
pd.Series(data = labels)

0    a
1    b
2    c
dtype: object

In [475]:
series1 = pd.Series([1,2,3,4], index='USA Germany Italy Japan'.split(' '))
series1

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [476]:
series2 = pd.Series([1,2,3,4], index='USA Germany Italy Thailand'.split(' '))
series2

USA         1
Germany     2
Italy       3
Thailand    4
dtype: int64

In [477]:
series1  + series2

Germany     4.0
Italy       6.0
Japan       NaN
Thailand    NaN
USA         2.0
dtype: float64

# Pandas Data Frame

In [478]:
from numpy.random import randn
np.random.seed(101)

In [479]:
df = pd.DataFrame( randn(5,4),index='a b c d e'.split(), columns='A B C D'.split())
df

          A         B         C         D
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [480]:
df[['A', 'B']]

          A         B
a  2.706850  0.628133
b  0.651118 -0.319318
c -2.018168  0.740122
d  0.188695 -0.758872
e  0.190794  1.978757

In [481]:
df.A

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: A, dtype: float64

In [482]:
df.drop('D' ,axis=1)

          A         B         C
a  2.706850  0.628133  0.907969
b  0.651118 -0.319318 -0.848077
c -2.018168  0.740122  0.528813
d  0.188695 -0.758872 -0.933237
e  0.190794  1.978757  2.605967

forze remove

In [483]:
df.drop('D', axis=1, inplace=True)
df

          A         B         C
a  2.706850  0.628133  0.907969
b  0.651118 -0.319318 -0.848077
c -2.018168  0.740122  0.528813
d  0.188695 -0.758872 -0.933237
e  0.190794  1.978757  2.605967

insert values

In [484]:
df['D'] = pd.DataFrame(randn(5,1), index=df.index, columns=['D'])
df

          A         B         C         D
a  2.706850  0.628133  0.907969  0.302665
b  0.651118 -0.319318 -0.848077  1.693723
c -2.018168  0.740122  0.528813 -1.706086
d  0.188695 -0.758872 -0.933237 -1.159119
e  0.190794  1.978757  2.605967 -0.134841

Row selection

In [485]:
df.loc['a']

A    2.706850
B    0.628133
C    0.907969
D    0.302665
Name: a, dtype: float64

In [486]:
df.iloc[0]

A    2.706850
B    0.628133
C    0.907969
D    0.302665
Name: a, dtype: float64

In [487]:
df.loc['a']['A':]

A    2.706850
B    0.628133
C    0.907969
D    0.302665
Name: a, dtype: float64

In [488]:
df > 0

       A      B      C      D
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False  False
e   True   True   True  False

Filter values

In [489]:
df[df> 0]

          A         B         C         D
a  2.706850  0.628133  0.907969  0.302665
b  0.651118       NaN       NaN  1.693723
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN       NaN
e  0.190794  1.978757  2.605967       NaN

In [490]:
df

          A         B         C         D
a  2.706850  0.628133  0.907969  0.302665
b  0.651118 -0.319318 -0.848077  1.693723
c -2.018168  0.740122  0.528813 -1.706086
d  0.188695 -0.758872 -0.933237 -1.159119
e  0.190794  1.978757  2.605967 -0.134841

In [491]:
df[df['A'] < 1]

          A         B         C         D
b  0.651118 -0.319318 -0.848077  1.693723
c -2.018168  0.740122  0.528813 -1.706086
d  0.188695 -0.758872 -0.933237 -1.159119
e  0.190794  1.978757  2.605967 -0.134841

In [492]:
df[df['A'] < 1][['C','D']]

          C         D
b -0.848077  1.693723
c  0.528813 -1.706086
d -0.933237 -1.159119
e  2.605967 -0.134841

In [493]:
df

          A         B         C         D
a  2.706850  0.628133  0.907969  0.302665
b  0.651118 -0.319318 -0.848077  1.693723
c -2.018168  0.740122  0.528813 -1.706086
d  0.188695 -0.758872 -0.933237 -1.159119
e  0.190794  1.978757  2.605967 -0.134841

In [494]:
df[(df['A'] < 1) & (df['B'] < 1)]

          A         B         C         D
b  0.651118 -0.319318 -0.848077  1.693723
c -2.018168  0.740122  0.528813 -1.706086
d  0.188695 -0.758872 -0.933237 -1.159119

In [495]:
new_id='aa,bb,cc,dd,ee'.split(',')
random_value = randn(5,4)
col = 'AA,BB,CC,DD'.split(',')
df = pd.DataFrame(random_value, index=new_id, columns=col)
df

          AA        BB        CC        DD
aa  0.390528  0.166905  0.184502  0.807706
bb  0.072960  0.638787  0.329646 -0.497104
cc -0.754070 -0.943406  0.484752 -0.116773
dd  1.901755  0.238127  1.996652 -0.993263
ee  0.196800 -1.136645  0.000366  1.025984

In [496]:
df.reset_index()

  index        AA        BB        CC        DD
0    aa  0.390528  0.166905  0.184502  0.807706
1    bb  0.072960  0.638787  0.329646 -0.497104
2    cc -0.754070 -0.943406  0.484752 -0.116773
3    dd  1.901755  0.238127  1.996652 -0.993263
4    ee  0.196800 -1.136645  0.000366  1.025984

In [497]:
df['index']=new_id
df

          AA        BB        CC        DD index
aa  0.390528  0.166905  0.184502  0.807706    aa
bb  0.072960  0.638787  0.329646 -0.497104    bb
cc -0.754070 -0.943406  0.484752 -0.116773    cc
dd  1.901755  0.238127  1.996652 -0.993263    dd
ee  0.196800 -1.136645  0.000366  1.025984    ee

Set index

In [498]:
df= df.set_index('index')

In [499]:
df

             AA        BB        CC        DD
index
aa     0.390528  0.166905  0.184502  0.807706
bb     0.072960  0.638787  0.329646 -0.497104
cc    -0.754070 -0.943406  0.484752 -0.116773
dd     1.901755  0.238127  1.996652 -0.993263
ee     0.196800 -1.136645  0.000366  1.025984

Multi-index

In [500]:
outside = 'G1,G1,G1,G2,G2,G2'.split(',')
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [501]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [502]:
df = pd.DataFrame(randn(6,5), index=hier_index,columns='aa,bb,cc,bb,ee'.split(','))
df

            aa        bb        cc        bb        ee
G1 1 -0.156598 -0.031579  0.649826  2.154846 -0.610259
   2 -0.755325 -0.346419  0.147027 -0.479448  0.558769
   3  1.024810 -0.925874  1.862864 -1.133817  0.610478
G2 1  0.386030  2.084019 -0.376519  0.230336  0.681209
   2  1.035125 -0.031160  1.939932 -1.005187 -0.741790
   3  0.187125 -0.732845 -1.382920  1.482495  0.961458

In [503]:
df.loc['G1']

         aa        bb        cc        bb        ee
1 -0.156598 -0.031579  0.649826  2.154846 -0.610259
2 -0.755325 -0.346419  0.147027 -0.479448  0.558769
3  1.024810 -0.925874  1.862864 -1.133817  0.610478

In [504]:
df.index.names=['Group', 'name']
df

                  aa        bb        cc        bb        ee
Group name
G1    1    -0.156598 -0.031579  0.649826  2.154846 -0.610259
      2    -0.755325 -0.346419  0.147027 -0.479448  0.558769
      3     1.024810 -0.925874  1.862864 -1.133817  0.610478
G2    1     0.386030  2.084019 -0.376519  0.230336  0.681209
      2     1.035125 -0.031160  1.939932 -1.005187 -0.741790
      3     0.187125 -0.732845 -1.382920  1.482495  0.961458

In [505]:
df.loc['G1']

            aa        bb        cc        bb        ee
name
1    -0.156598 -0.031579  0.649826  2.154846 -0.610259
2    -0.755325 -0.346419  0.147027 -0.479448  0.558769
3     1.024810 -0.925874  1.862864 -1.133817  0.610478

In [506]:
df.xs('G1')

            aa        bb        cc        bb        ee
name
1    -0.156598 -0.031579  0.649826  2.154846 -0.610259
2    -0.755325 -0.346419  0.147027 -0.479448  0.558769
3     1.024810 -0.925874  1.862864 -1.133817  0.610478

In [507]:
df.xs('G1').loc[1]

aa   -0.156598
bb   -0.031579
cc    0.649826
bb    2.154846
ee   -0.610259
Name: 1, dtype: float64

In [508]:
df.xs(1, level='name')

             aa        bb        cc        bb        ee
Group
G1    -0.156598 -0.031579  0.649826  2.154846 -0.610259
G2     0.386030  2.084019 -0.376519  0.230336  0.681209

# Missing Data

In [509]:
df = pd.DataFrame({
    'A' : [1,2,np.nan, 4,5],
    'B' : [np.nan, 5,6,7,8],
    'C' : [10,11,np.nan,np.nan,14],
    'D' : [1 for i in range(5)]
})
df

     A    B     C  D
0  1.0  NaN  10.0  1
1  2.0  5.0  11.0  1
2  NaN  6.0   NaN  1
3  4.0  7.0   NaN  1
4  5.0  8.0  14.0  1

Filter value

In [510]:
df.dropna()

     A    B     C  D
1  2.0  5.0  11.0  1
4  5.0  8.0  14.0  1

In [511]:
df.dropna(axis=1)

   D
0  1
1  1
2  1
3  1
4  1

In [512]:
df.dropna(thresh=4)

     A    B     C  D
1  2.0  5.0  11.0  1
4  5.0  8.0  14.0  1

In [513]:
df.fillna(value = 'fill-value')

            A           B           C  D
0         1.0  fill-value        10.0  1
1         2.0         5.0        11.0  1
2  fill-value         6.0  fill-value  1
3         4.0         7.0  fill-value  1
4         5.0         8.0        14.0  1

In [514]:
df['A'] = df['A'].fillna(value = df['A'].mean())
df['B'] = df['B'].fillna(value=df['B'][1]-1)
df['C'] = df['C'].fillna(value=12)
df

     A    B     C  D
0  1.0  4.0  10.0  1
1  2.0  5.0  11.0  1
2  3.0  6.0  12.0  1
3  4.0  7.0  12.0  1
4  5.0  8.0  14.0  1

# Group By

In [515]:
data = {
    'Company' : 'SCG,SCG,PTT,PTT,KTB,KTB'.split(','),
    'Person' : ['Somsri', 'Somchai', 'Sompong', 'Somsak', 'Sommai', 'Somsap'],
    'Sales' : [100 ,120, 200, 140, 190, 200]
}
df = pd.DataFrame(data)
df

  Company   Person  Sales
0     SCG   Somsri    100
1     SCG  Somchai    120
2     PTT  Sompong    200
3     PTT   Somsak    140
4     KTB   Sommai    190
5     KTB   Somsap    200

In [516]:
group_by = df.groupby('Company')['Sales']

In [517]:
group_by.mean()

Company
KTB    195.0
PTT    170.0
SCG    110.0
Name: Sales, dtype: float64

In [518]:
group_by.std()

Company
KTB     7.071068
PTT    42.426407
SCG    14.142136
Name: Sales, dtype: float64

In [519]:
group_by.min()

Company
KTB    190
PTT    140
SCG    100
Name: Sales, dtype: int64

In [520]:
group_by.max()

Company
KTB    200
PTT    200
SCG    120
Name: Sales, dtype: int64

In [521]:
df.groupby('Company').count()

         Person  Sales
Company
KTB           2      2
PTT           2      2
SCG           2      2

In [522]:
df.groupby('Company').describe()

        Sales
        count   mean        std    min    25%    50%    75%    max
Company
KTB       2.0  195.0   7.071068  190.0  192.5  195.0  197.5  200.0
PTT       2.0  170.0  42.426407  140.0  155.0  170.0  185.0  200.0
SCG       2.0  110.0  14.142136  100.0  105.0  110.0  115.0  120.0

In [523]:
df.groupby('Company').describe().transpose()

Company             KTB         PTT         SCG
Sales count    2.000000    2.000000    2.000000
      mean   195.000000  170.000000  110.000000
      std      7.071068   42.426407   14.142136
      min    190.000000  140.000000  100.000000
      25%    192.500000  155.000000  105.000000
      50%    195.000000  170.000000  110.000000
      75%    197.500000  185.000000  115.000000
      max    200.000000  200.000000  120.000000

In [524]:
df.groupby('Company').describe().transpose()['KTB']

Sales  count      2.000000
       mean     195.000000
       std        7.071068
       min      190.000000
       25%      192.500000
       50%      195.000000
       75%      197.500000
       max      200.000000
Name: KTB, dtype: float64

# Mergin , Joining , Concatenation

In [525]:
df1 = pd.DataFrame({
    'A' : "A1 A2 A3 A4".split(' '),
    'B' : "B1 B2 B3 B4".split(' '),
    'C' : "C1 C2 C3 C4".split(' '),
    
},index=[1,2,3,4])

df2 = pd.DataFrame({
    'A' : "A5 A6 A7 A8".split(' '),
    'B' : "B5 B6 B7 B8".split(' '),
    'C' : "C5 C6 C7 C8".split(' '),
    
},index=[5,6,7,8])
df3 = pd.DataFrame({
    'A' : "A9 A10 A11 A12".split(' '),
    'B' : "B9 B10 B11 B12".split(' '),
    'C' : "C9 C10 C11 C12".split(' '),
    
},index=[9,10,11,12])

In [526]:
df1

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4

In [527]:
df2

    A   B   C
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [528]:
df3

      A    B    C
9    A9   B9   C9
10  A10  B10  C10
11  A11  B11  C11
12  A12  B12  C12

In [529]:
pd.concat([df1,df2,df3])

      A    B    C
1    A1   B1   C1
2    A2   B2   C2
3    A3   B3   C3
4    A4   B4   C4
5    A5   B5   C5
6    A6   B6   C6
7    A7   B7   C7
8    A8   B8   C8
9    A9   B9   C9
10  A10  B10  C10
11  A11  B11  C11
12  A12  B12  C12

In [530]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    A    B    C    A    B    C
1    A1   B1   C1  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3  NaN  NaN  NaN  NaN  NaN  NaN
4    A4   B4   C4  NaN  NaN  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN   A5   B5   C5  NaN  NaN  NaN
6   NaN  NaN  NaN   A6   B6   C6  NaN  NaN  NaN
7   NaN  NaN  NaN   A7   B7   C7  NaN  NaN  NaN
8   NaN  NaN  NaN   A8   B8   C8  NaN  NaN  NaN
9   NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9
10  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10
11  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11
12  NaN  NaN  NaN  NaN  NaN  NaN  A12  B12  C12

In [532]:
left = pd.DataFrame({
    'key': 'k1 k2 k3 k4'.split(),
    'A' : 'a1 a2 a3 a4'.split(),
    'B': 'b1 b2 b3 b4'.split()
})

right = pd.DataFrame({
    'key': 'k1 k2 k3 k4'.split(),
    'C' : 'c1 c2 c3 c4'.split(),
    'D': 'd1 d2 d3 d4'.split()
})

In [534]:
left

  key   A   B
0  k1  a1  b1
1  k2  a2  b2
2  k3  a3  b3
3  k4  a4  b4

In [535]:
right

  key   C   D
0  k1  c1  d1
1  k2  c2  d2
2  k3  c3  d3
3  k4  c4  d4

In [537]:
pd.merge(left, right, how = 'inner', on= 'key')

  key   A   B   C   D
0  k1  a1  b1  c1  d1
1  k2  a2  b2  c2  d2
2  k3  a3  b3  c3  d3
3  k4  a4  b4  c4  d4

In [538]:
pd.merge(left, right, how = 'left', on= 'key')

  key   A   B   C   D
0  k1  a1  b1  c1  d1
1  k2  a2  b2  c2  d2
2  k3  a3  b3  c3  d3
3  k4  a4  b4  c4  d4

In [539]:
left = pd.DataFrame({
    'key1' : 'k2 k2 k3 k4'.split(),
    'key': 'k1 k2 k3 k3'.split(),
    'A' : 'a1 a2 a3 a4'.split(),
    'B': 'b1 b2 b3 b4'.split()
})

right = pd.DataFrame({
    'key1' : 'k1 k2 k3 k4'.split(),
    'key': 'k1 k2 k3 k4'.split(),
    'C' : 'c1 c2 c3 c4'.split(),
    'D': 'd1 d2 d3 d4'.split()
})

In [540]:
left

  key1 key   A   B
0   k2  k1  a1  b1
1   k2  k2  a2  b2
2   k3  k3  a3  b3
3   k4  k3  a4  b4

In [541]:
right

  key1 key   C   D
0   k1  k1  c1  d1
1   k2  k2  c2  d2
2   k3  k3  c3  d3
3   k4  k4  c4  d4

inner

In [543]:
pd.merge(left, right, on=['key1', 'key'])

  key1 key   A   B   C   D
0   k2  k2  a2  b2  c2  d2
1   k3  k3  a3  b3  c3  d3

union

In [544]:
pd.merge(left, right, how='outer',on=['key1', 'key'])

  key1 key    A    B    C    D
0   k1  k1  NaN  NaN   c1   d1
1   k2  k1   a1   b1  NaN  NaN
2   k2  k2   a2   b2   c2   d2
3   k3  k3   a3   b3   c3   d3
4   k4  k3   a4   b4  NaN  NaN
5   k4  k4  NaN  NaN   c4   d4

right

In [545]:
pd.merge(left, right, how='right',on=['key1', 'key'])

  key1 key    A    B   C   D
0   k1  k1  NaN  NaN  c1  d1
1   k2  k2   a2   b2  c2  d2
2   k3  k3   a3   b3  c3  d3
3   k4  k4  NaN  NaN  c4  d4

left

In [546]:
pd.merge(left, right, how='left',on=['key1', 'key'])

  key1 key   A   B    C    D
0   k2  k1  a1  b1  NaN  NaN
1   k2  k2  a2  b2   c2   d2
2   k3  k3  a3  b3   c3   d3
3   k4  k3  a4  b4  NaN  NaN

joining

In [554]:
left = pd.DataFrame({
    'A' : ['A1', 'A2', 'A3'],
    'B' : ['B1', 'B2', 'B3']
}, index ='K1,K2,K3'.split(','))


right = pd.DataFrame({
    'C' : ['C1', 'C2', 'C3', 'C4'],
    'D' : ['D1', 'D2', 'D3', 'D4']
}, index ='K1,K2,K3,k4'.split(','))

In [555]:
left

     A   B
K1  A1  B1
K2  A2  B2
K3  A3  B3

In [556]:
right

     C   D
K1  C1  D1
K2  C2  D2
K3  C3  D3
k4  C4  D4

In [558]:
left.join(right)

     A   B   C   D
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

In [559]:
left.join(right, how='outer')

      A    B   C   D
K1   A1   B1  C1  D1
K2   A2   B2  C2  D2
K3   A3   B3  C3  D3
k4  NaN  NaN  C4  D4

In [552]:
right.join(left)

     C   D   A   B
K1  C1  D1  A1  B1
K2  C2  D2  A2  B2
K3  C3  D3  A3  B3

# Operation

In [561]:
df=pd.DataFrame({
    'col1':[1,2,3,4],
    'col2':[44,55,66,44],
    'col3':'aa,bb,cc,dd'.split(','),
})
df

   col1  col2 col3
0     1    44   aa
1     2    55   bb
2     3    66   cc
3     4    44   dd

In [562]:
df['col2'].unique()

array([44, 55, 66], dtype=int64)

In [564]:
df['col2'].nunique()

3

In [565]:
df['col2'].value_counts()

col2
44    2
55    1
66    1
Name: count, dtype: int64

In [568]:
newdf = df[(df['col1'] > 2) & (df['col2'] ==44)]
newdf

   col1  col2 col3
3     4    44   dd

In [570]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [573]:
df['col1'].apply(lambda x : x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [576]:
# df['col3'].apply(lambda x : len(x))
df['col3'].apply(len)

0    2
1    2
2    2
3    2
Name: col3, dtype: int64

In [577]:
df['col1'].sum()

10

In [578]:
del df['col1']

In [579]:
df

   col2 col3
0    44   aa
1    55   bb
2    66   cc
3    44   dd

In [581]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [584]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [587]:
df.sort_values(by='col2')

   col2 col3
0    44   aa
3    44   dd
1    55   bb
2    66   cc

In [589]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [590]:
df.dropna()

   col2 col3
0    44   aa
1    55   bb
2    66   cc
3    44   dd

In [592]:
df = pd.DataFrame({
    'col1':[1,2,3,np.nan],
    'col2':[44,np.nan,66,44],
    'col3':'aa,bb,cc,dd'.split(','),
})
df

   col1  col2 col3
0   1.0  44.0   aa
1   2.0   NaN   bb
2   3.0  66.0   cc
3   NaN  44.0   dd

In [593]:
df.fillna('Fill')

   col1  col2 col3
0   1.0  44.0   aa
1   2.0  Fill   bb
2   3.0  66.0   cc
3  Fill  44.0   dd

In [599]:
data = {
    'A':['foo' for i in range(6)],
    'B':'one one two two one one'.split(),
    'C':'x y x y x y'.split(),
    'D':[1,2,3,5,4,1],
}
df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  2
2  foo  two  x  3
3  foo  two  y  5
4  foo  one  x  4
5  foo  one  y  1

In [607]:
# df.pivot_table(value=df['D'],index=df['A'],columns=df['C'])
df.pivot_table(values='D', index='A', columns='C', aggfunc='mean')

C           x         y
A
foo  2.666667  2.666667

# Input & Output

In [4]:
df = pd.DataFrame({
    'a': [1,2,3,4],
    'b' : [5,6,7,8],
    'c' : [9,10,11,12]
})
df

   a  b   c
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

CSV file

In [7]:
df.to_csv('example.csv',index=False)

In [15]:
df = pd.read_csv('example.csv')
df

   a  b   c
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

Excel file

In [16]:
df.to_excel('example.xlsx', index=False)

In [17]:
df = pd.read_excel('example.xlsx')
df

   a  b   c
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

HTML

In [20]:
data_html = pd.read_html("https://www.set.or.th/th/market/product/stock/quote/PTT/historical-trading")

In [22]:
data_html[0]

,(Click to sort Ascending),(Click to sort Ascending).1,(Click to sort Ascending).2,(Click to sort Ascending).3,(Click to sort Ascending).4,(Click to sort Ascending).5,(Click to sort Ascending).6,(Click to sort Ascending).7,(Click to sort Ascending).8
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN